Tekla Open API Reference for Tekla Structures 2025
CrossSection.GetOuterContour Method
 Gets the outer loop geometry as Polycurve.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve GetOuterContour()
Public Function GetOuterContour As Polycurve
Return Value
Type: Polycurve
Polycurve
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace